Revit 2027 API
CanExecuteEventArgs.CanExecute Property
The value that indicates whether the Command associated with this event can be executed.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanExecute { get; set; }
Public Property CanExecute As Boolean
	Get
	Set
public:
property bool CanExecute {
	bool get ();
	void set (bool value);
}
member CanExecute : bool with get, set
Property Value
Boolean
See Also
Reference
CanExecuteEventArgs Class
Autodesk.Revit.UI.Events Namespace